OdGiContextualColors.contextualColorTint(OdGiContextualColors.ColorTint)
\details
Checks whether X, Y and Z axis color tinting is applied to the specified interface element.
\param type [in]  Interface element.
\returns
true if tinting is applied to a specified interface element, false otherwise.

OdGiContextualColors.contextualColor(OdGiContextualColors.ColorType)
\details
Retrieves the color of the specified interface element in the current vectorization context.
\param type [in]  Interface element.
\returns
color of the specified interface element as OdCmEntityColor instance.

OdGiContextualColors.flagsSet(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Retrieves the current state of the specified runtime context flag.
\param nFlags [in]  Flag of the state that should be checked.
\returns
true if the specified flag is set, false otherwise.

OdGiContextualColors.setContextFlags(System.UInt32!System.Runtime.CompilerServices.IsLong,System.Boolean)
\details
Sets the specified runtime context flag to the specified value.
\param nFlags [in]  Flag to set.
\param bSet [in]  Value to set.

OdGiContextualColors.cameraClipping
\details
Retrieves the color of the camera clipping planes in the current vectorization context.
\returns
color of the camera clipping planes as OdCmEntityColor instance.

OdGiContextualColors.cameraFrustrum
\details
Retrieves the color of the camera frustrum in the current vectorization context.
\returns
color of the camera frustrum as OdCmEntityColor instance.

OdGiContextualColors.cameraGlyphs
\details
Retrieves the color of the camera glyphs in the current vectorization context.
\returns
color of the camera glyphs as OdCmEntityColor instance.

OdGiContextualColors.webMeshMissingColor
\details
Retrieves the color of the web light glyphs in the current vectorization context
when the web light file is unavailable.
\returns
color of the web light shape glyph as OdCmEntityColor instance.

OdGiContextualColors.webMeshColor
\details
Retrieves the color of the web light glyphs in the current vectorization context.
\returns
color of the web light glyph as OdCmEntityColor instance.

OdGiContextualColors.lightDistanceColor
\details
Retrieves the color of the light distance glyphs in the current vectorization context.
\returns
color of the light distance glyph as OdCmEntityColor instance.

OdGiContextualColors.lightShapeColor
\details
Retrieves the color of the light shape glyph in the current vectorization context.
\returns
color of the light shape glyph as OdCmEntityColor instance.

OdGiContextualColors.lightEndLimit
\details
Retrieves the color of the light end limit indicator in the current vectorization context.
\returns
color of the light end limit indicator as OdCmEntityColor instance.

OdGiContextualColors.lightStartLimit
\details
Retrieves the color of the light start limit indicator in the current vectorization context.
\returns
color of the light start limit indicator as OdCmEntityColor instance.

OdGiContextualColors.lightFalloff
\details
Retrieves the color of the light fall off area in the current vectorization context.
\returns
color of the light fall off area as OdCmEntityColor instance.

OdGiContextualColors.lightHotspot
\details
Retrieves the color of the light hotspot in the current vectorization context.
\returns
color of the light hotspot as OdCmEntityColor instance.

OdGiContextualColors.lightGlyphs
\details
Retrieves the color of light glyphs in the current vectorization context.
\returns
color of light glyphs as OdCmEntityColor instance.

OdGiContextualColors.gridAxisLineTintXYZ
\details
Checks whether X, Y and Z axis color tinting is applied to the axis rays emitted from the grid origin
in the current vectorization context. Otherwise returns false.
\returns
true if the X, Y and Z axis color tinting is applied to the axis rays emitted from the grid origin, false otherwise

OdGiContextualColors.gridMinorLineTintXYZ
\details
Checks whether X, Y and Z axis color tinting is applied to the minor grid lines
in the current vectorization context.
\returns
true if the X, Y and Z axis color tinting is applied to the minor grid lines, false otherwise

OdGiContextualColors.gridMajorLineTintXYZ
\details
Checks whether X, Y and Z axis color tinting is applied to the major grid lines
in the current vectorization context.
\returns
true if the X, Y and Z axis color tinting is applied to the major grid lines, false otherwise

OdGiContextualColors.gridAxisLines
\details
Retrieves the color of axis rays emitted from the grid origin in the current vectorization context.
\returns
color of axis rays emitted from the grid origin as OdCmEntityColor instance.

OdGiContextualColors.gridMinorLines
\details
Retrieves the color of minor grid lines in the current vectorization context.
\returns
color of minor grid lines as OdCmEntityColor instance.

OdGiContextualColors.gridMajorLines
\details
Retrieves the color of major grid lines in the current vectorization context.
\returns
color of major grid lines as OdCmEntityColor instance.